areiter128/SMPS-MCAL-PLIB/p33SMPS_mcal.X/plibs/dsPIC33C/p33SMPS_hsadc.c
/*LICENSE *****************************************************************************************
 *
 * Software License Agreement
 *
 * Copyright (R) 2012 Microchip Technology Inc.  All rights reserved. Microchip licenses to you the
 * right to use, modify, copy and distribute Software only when embedded on a Microchip 
 * microcontroller or digital signal controller, which is integrated into your product or third 
 * party product (pursuant to the sublicense terms in the accompanying license agreement).
 *
 * You should refer to the license agreement accompanying this Software for additional information 
 * regarding your rights and obligations.
 *
 * SOFTWARE AND DOCUMENTATION ARE PROVIDED "AS IS" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR 
 * IMPLIED, INCLUDING WITHOUT LIMITATION, ANY WARRANTY OF MERCHANTABILITY, TITLE, NON-INFRINGEMENT 
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT SHALL MICROCHIP OR ITS LICENSORS BE LIABLE OR
 * OBLIGATED UNDER CONTRACT, NEGLIGENCE, STRICT LIABILITY, CONTRIBUTION, BREACH OF WARRANTY, OR 
 * OTHER LEGAL EQUITABLE THEORY ANY DIRECT OR INDIRECT DAMAGES OR EXPENSES INCLUDING BUT NOT  
 * LIMITED TO ANY INCIDENTAL, SPECIAL, INDIRECT, PUNITIVE OR CONSEQUENTIAL DAMAGES, LOST PROFITS  
 * OR LOST DATA, COST OF PROCUREMENT OF SUBSTITUTE GOODS, TECHNOLOGY, SERVICES, OR ANY CLAIMS BY  
 * THIRD PARTIES (INCLUDING BUT NOT LIMITED TO ANY DEFENSE THEREOF), OR OTHER SIMILAR COSTS.
 *
 * ***********************************************************************************************/

#include <xc.h> // Device header file
#include <stdint.h>
#include <stdbool.h>

#include "p33SMPS_hsadc.h"


/*!p33EGS_adc.c
 * ************************************************************************************************
 * Summary:
 * Driver file for the dsPIC33ExxGS-ADC SFRs
 *
 * Description:
 * The SMPS ADC module offers a number of registers and configuration options. This additional
 * driver file contains initialization routines for all majority required settings.
 * ***********************************************************************************************/


/*!hsadc_module_power_up()
 * *****************************************************************************************************
 * Summary:
 * Turns on the base power of the ADC module 
 *
 * Parameters: 
 *   (none)
 *
 * Description:
 * 
 * *****************************************************************************************************/

inline volatile uint16_t hsadc_module_power_up(void)
{
    volatile uint16_t fres=0;
    
        #if defined (_ABGMD)
        _ABGMD = 0;         // Turn on power to analog bandgap reference
        fres = (1-_ABGMD);
        #endif
        #if defined (_ADCMD)
        _ADCMD = 0; 		// Turn on power to ADC module
        fres &= (1-_ADCMD);
        #endif
        return(fres);

} 

/*!hsadc_module_power_down()
 * *****************************************************************************************************
 * Summary:
 * Turns off the base power of the ADC module 
 *
 * Parameters: 
 *   (none)
 *
 * Description:
 * 
 * *****************************************************************************************************/

inline volatile uint16_t hsadc_module_power_down(void)
{
    #if defined (_ADCMD)
    _ADCMD = 1; 		// Turn on power to PWM channel #1
    return(_ADCMD);
    #else
    return(1);
    #endif

}

/*!hsadc_init_adc_module
 * ************************************************************************************************
 * Summary:
 * Initializes the basic ADC configuration
 *
 * Parameters:
 *	HSADC_MODULE_CONFIG_t adc_cfg = holds the register value for module base registers
 *
 * Description:
 * Basic options like clock source, early interrupts, format options, sampling order and modes
 * are set here.
 * ***********************************************************************************************/
inline volatile uint16_t hsadc_init_adc_module( HSADC_MODULE_CONFIG_t adc_cfg )
{
    volatile uint16_t fres = 1;
    volatile uint32_t *regptr32;
    volatile uint32_t regbuf32;
    
    // Ensure ADC module is powered up before registers are written
    fres &= hsadc_module_power_up();
    
	// Reset all ADC configuration registers to defaults

	ADCON1L	= REG_ADCON1L_RESET;			// Disable and reset ADC configuration register 1 low
	ADCON1H	= REG_ADCON1H_RESET;			// Disable and reset ADC configuration register 1 high
	ADCON2L	= REG_ADCON2L_RESET;			// Disable and reset ADC configuration register 2 low
	ADCON2H	= REG_ADCON2H_RESET;			// Disable and reset ADC configuration register 2 high
    ADCON3L = REG_ADCON3L_RESET;			// Disable and reset ADC configuration register 3 low
    ADCON3H = REG_ADCON3H_RESET;			// Disable and reset ADC configuration register 3 high
    #if defined (ADCON4L) && defined (ADCON4H)  // Registers ADCON4L/H are only available if ADC has dedicated cores
    ADCON4L = REG_ADCON4L_RESET;			// Disable and reset ADC configuration register 4 low
    ADCON4H = REG_ADCON4H_RESET;			// Disable and reset ADC configuration register 4 high
    #endif
    ADCON5L = REG_ADCON5L_RESET;			// Disable and reset ADC configuration register 5 low
    ADCON5H = REG_ADCON5H_RESET;			// Disable and reset ADC configuration register 5 high
    
	// Setting ADC configuration block #1 according to user settings.
	// Please note:
	//   ADC ENABLE is masked out! The ADC has to be enabled by the user in software.
		
    regptr32 = (volatile uint32_t*) ((volatile uint8_t*)&ADCON1L);
    *regptr32 = (adc_cfg.ADCON1.value & (REG_ADCON1_OFF_STATE_WRITE_MSK));
    regbuf32 = *regptr32;
    if(regbuf32 == (adc_cfg.ADCON1.value & REG_ADCON1_OFF_STATE_WRITE_MSK))
    { fres = 1; }
    else
    { fres = 0; }
    
	// Setting ADC configuration block #2 according to user settings.
    
    regptr32 = (volatile uint32_t*) ((volatile uint8_t*)&ADCON2L);
    *regptr32 = (adc_cfg.ADCON2.value & (REG_ADCON2_VALID_DATA_WRITE_MSK));
    regbuf32 = *regptr32;
    if(regbuf32 == (adc_cfg.ADCON2.value & REG_ADCON2_VALID_DATA_WRITE_MSK))
    { fres &= 1; }
    else
    { fres = 0; }

	// Setting ADC configuration block #3 according to user settings.
    
