areiter128/SMPS-MCAL-PLIB/p33SMPS_mcal.X/plibs/dsPIC33C/p33SMPS_hsadc.c
    regptr32 = (volatile uint32_t*) ((volatile uint8_t*)&ADCON3L);
    *regptr32 = ((adc_cfg.ADCON3.value & REG_ADCON3_DISABLE_ADC_CORES_MSK) & (REG_ADCON3_VALID_DATA_WRITE_MSK));
    regbuf32 = *regptr32;
    if(regbuf32 == ((adc_cfg.ADCON3.value & REG_ADCON3_DISABLE_ADC_CORES_MSK) & REG_ADCON3_VALID_DATA_WRITE_MSK))
    { fres &= 1; }
    else
    { fres = 0; }

	// Setting ADC configuration block #3 according to user settings.
    #if defined(ADCON4L)
    regptr32 = (volatile uint32_t*) ((volatile uint8_t*)&ADCON4L);
    *regptr32 = (adc_cfg.ADCON4.value & (REG_ADCON4_VALID_DATA_WRITE_MSK));
    regbuf32 = *regptr32;
    if(regbuf32 == (adc_cfg.ADCON4.value & REG_ADCON4_VALID_DATA_WRITE_MSK))
    { fres &= 1; }
    else
    { fres = 0; }
    #endif
    
	// Setting ADC configuration block #5 according to user settings.
    
    regptr32 = (volatile uint32_t*) ((volatile uint8_t*)&ADCON5L);
    *regptr32 = ((adc_cfg.ADCON5.value & REG_ADCON5_DISABLE_ADC_CORES_MSK) & (REG_ADCON5_VALID_DATA_WRITE_MSK));
    regbuf32 = *regptr32;
    if(regbuf32 == ((adc_cfg.ADCON5.value & REG_ADCON5_DISABLE_ADC_CORES_MSK) & REG_ADCON5_VALID_DATA_WRITE_MSK))
    { fres &= 1; }
    else
    { fres = 0; }


    // Return 1=success, 0=failure
	return(fres);

}


/*!hsadc_init_adc_channel
 * ************************************************************************************************
 * Summary:
 * Initializes an individual ADC input configuration
 *
 * Parameters:
 *	HSADC_CHANNEL_CONFIG_t = holds all available settings of one ADC input (e.g. AN3)
 *
 * Description:
 * This routine configures the individual settings of an analog input .
 * ***********************************************************************************************/

inline volatile uint16_t hsadc_init_adc_channel( HSADC_CHANNEL_CONFIG_t adin_cfg ) {
    
    volatile uint16_t fres = 1;
    
    // Check if given analog input number is available
    if(adin_cfg.ad_input > ADC_ANINPUT_COUNT) { return(0); }
    
    // Set AD input mode (differential or single ended)
    fres &= hsadc_set_adc_input_mode(adin_cfg.ad_input, 
            adin_cfg.config.bits.input_mode, adin_cfg.config.bits.data_mode);

    // Set interrupt enable and early interrupt enable
    fres &= hsadc_set_adc_input_interrupt(adin_cfg.ad_input, 
            adin_cfg.config.bits.interrupt_enable, adin_cfg.config.bits.early_interrupt_enable);
    
    // Set interrupt trigger source
    fres &= hsadc_set_adc_input_trigger_source(adin_cfg.ad_input, adin_cfg.config.bits.trigger_source);

    // Set interrupt trigger mode (level/edge)
    fres &= hsadc_set_adc_input_trigger_mode(adin_cfg.ad_input, adin_cfg.config.bits.trigger_mode);

    
    return(fres);
    
}


/*!hsadc_init_adc_core
 * ************************************************************************************************
 * Summary:
 * Initializes an individual ADC Core configuration (dedicated or shared)
 *
 * Parameters:
 *	HSADC_ADCOREx_CONFIG_t core_cfg  data structure holding all required ADC core 
 *                          configuration settings
 *
 * Description:
 * Fundamental operating settings of a dedicated or shared core are written to the respective
 * registers, such as like conversion delay, early interrupt period, ADC resolution and 
 * input clock dividers. 
 * 
 * Dedicated ADC cores have their own register set (ADCORExH, ADCORExL) while the shared core 
 * settings are distributed across multiple registers (ADCON1H and ADCON2L). This routine
 * offers one function call for both and treats the settings accordingly.
 * 
 * As different devices may have a different number of dedicated cores, the highest index
 * is always taken as index of the shared ADC core instance.
 * ***********************************************************************************************/

inline volatile uint16_t hsadc_init_adc_core(uint16_t index, HSADC_ADCOREx_CONFIG_t adcore_cfg)
{

    volatile uint16_t fres = 1;     // Success/Failure result
    volatile uint16_t *regptr;      // Register address pointer
    volatile uint16_t reg_buf=0;    // Register value buffer

    // Variables for shared ADC core configuration
    volatile REGBLK_ADCON1H_t regADCON1H;  // ADCON1H register copy for WRITE operation
    volatile REGBLK_ADCON2L_t regADCON2L;  // ADCON2L register copy for WRITE operation
    volatile REGBLK_ADCON2H_t regADCON2H;  // ADCON2H register copy for WRITE operation
    
    // Variables for dedicated ADC core configuration
    #if defined (ADCORE0L)
    volatile REGBLK_ADCORExL_t regADCORExL; // ADCORExL register copy for WRITE operation
    volatile REGBLK_ADCORExH_t regADCORExH; // ADCORExH register copy for WRITE operation
    volatile uint16_t reg_offset=0;
    #endif


    // check if given ADC core instance index is greater than number of available ADC cores
	if (index >= ADC_CORE_COUNT) return(0);

    // Check which core type needs to be configured
    if(adcore_cfg.type == ADCORE_TYPE_DEDICATED)
    {
        // Dedicated cores have their individual configuration 
        // registers ADCORExL and ADCORExH
        
        #if defined (ADCORE0L)
        // Dual core devices like dsPIC33CH only have shared cores on the master side.
        // Only slave cores and single core devices like dsPIC33CK have multiple dedicated
        // cores and one shared core. The shared core always has the highest instance index.

        reg_offset = (index-1) * ((volatile uint16_t)&ADCORE1L - (volatile uint16_t)&ADCORE0L); // Get register set offset

        regADCORExL.bits.SAMC = adcore_cfg.config.bits.SAMC;      // Capture ADC core configuration ADCORExL
        
        regptr = (volatile uint16_t *)&ADCORE0L + reg_offset;   // Get pointer to ADC core configuration register
        reg_buf = (regADCORExL.value & REG_ADCORExL_VALID_DATA_MSK);  // Get value to be written to register
        *regptr = reg_buf;                                      // Write configuration to register
        fres &= (volatile bool)((*regptr & REG_ADCORExL_VALID_DATA_MSK) == reg_buf);  // Check if WRITE operation was successful

        
        regADCORExH.bits.ADCS = adcore_cfg.config.bits.ADCS;    // Capture ADC core clock divider configuration
        regADCORExH.bits.EISEL = adcore_cfg.config.bits.EISEL;  // Capture ADC core Early Interrupt Period configuration
        regADCORExH.bits.RES = adcore_cfg.config.bits.RES;      // Capture ADC core resolution configuration

        regptr = (volatile uint16_t *)&ADCORE0H + reg_offset;   // Get pointer to ADC core configuration register
        reg_buf = (regADCORExH.value & REG_ADCORExH_VALID_DATA_MSK);  // Get value to be written to register
        *regptr = reg_buf;                                      // Write configuration to register
        fres &= (volatile bool)((*regptr & REG_ADCORExH_VALID_DATA_MSK) == reg_buf);  // Check if WRITE operation was successful

        #endif
        
