areiter128/SMPS-MCAL-PLIB/p33SMPS_mcal.X/plibs/dsPIC33C/p33SMPS_hsadc.c
    }
    else if(adcore_cfg.type == ADCORE_TYPE_SHARED)
    {
    
        // The configuration of the shared core is incorporated into the generic registers 
        // ADCON1H, ADCON2L and ADCON2H while dedicated cores have their own configuration 
        // registers ADCORExH and ADCORExL. The values, however, are identical and therefore
        // this library API treats them as equal on the surface but differently when accessing
        // registers. So don't get confused.
        
        // Set settings in ADCON1H register
        regptr = (volatile uint16_t *)&ADCON1H;   // Get pointer to ADC core configuration in ADC configuration #1 HIGH register

        regADCON1H.value = (volatile uint16_t)(*regptr & REG_ADCON1H_EXCLUDE_SHRADC_CFG_MSK); // Read register contents without RESOUTION setting
        regADCON1H.bits.SHRRES = adcore_cfg.config.bits.RES;  // Overwrite ADC core resolution configuration

        reg_buf = (regADCON1H.value & REG_ADCON1H_VALID_DATA_WRITE_MSK);  // Get value to be written to register
        *regptr = reg_buf;                                                // Write configuration to register
        fres &= (volatile bool)((*regptr & REG_ADCON1H_VALID_DATA_WRITE_MSK) == reg_buf);  // Check if WRITE operation was successful

        // Set settings in ADCON2L register
        regptr = (volatile uint16_t *)&ADCON2L;   // Get pointer to ADC core configuration in ADC configuration #2 LOW register
        
        regADCON2L.value = (volatile uint16_t)(*regptr & REG_ADCON2L_EXCLUDE_SHRADC_CFG_MSK); // Read register contents without RESOUTION setting 
        regADCON2L.bits.SHRADCS = adcore_cfg.config.bits.ADCS;    // Overwrite user defined ADC clock divider setting
        regADCON2L.bits.SHREISEL = adcore_cfg.config.bits.EISEL;  // Overwrite user defined ADC Early Interrupt Period
        
        reg_buf = (regADCON2L.value & REG_ADCON2L_VALID_DATA_MSK); // Read bandgap reference register bits
        *regptr = reg_buf;                                         // Write configuration to register
        fres &= (volatile bool)((*regptr & REG_ADCON2L_VALID_DATA_MSK) == reg_buf);  // Check if WRITE operation was successful

        // Set settings in ADCON2H register
        regptr = (volatile uint16_t *)&ADCON2H;   // Get pointer to ADC core configuration in ADC configuration #2 HIGH register
        
        regADCON2H.value = (volatile uint16_t)(*regptr & REG_ADCON2H_EXCLUDE_SHRADC_CFG_MSK); // Read register contents without SHARED CORE CONFIG setting 
        regADCON2H.bits.SHRSAMC = adcore_cfg.config.bits.SAMC;  // Overwrite user defined ADC sampling time setting
        
        reg_buf = (regADCORExL.value & REG_ADCON2H_VALID_DATA_MSK);
        *regptr = reg_buf;
        fres &= (volatile bool)((*regptr & REG_ADCON2H_VALID_DATA_MSK) == reg_buf);  // Check if WRITE operation was successful
    
    }
    else { return(0); } // Skip with error when unsupported setting has been chosen

    return(fres);
    
}


/*!hsadc_module_enable()
 * ************************************************************************************************
 * Summary:
 * Enables the ADC module
 *
 * Parameters: (none)
 *
 * Description:
 * The ADC module has a start-up time of a couple of micro seconds. Therefore the 
 * enable-instruction is followed by a short delay loop.
 * ***********************************************************************************************/

inline volatile uint16_t hsadc_module_enable(void)
{

	ADCON1Lbits.ADON	= ADC_ON; 	// Enable ADC module
	return(ADCON1Lbits.ADON);
	 
}

/*!hsadc_module_disable()
 * ************************************************************************************************
 * Summary:
 * Disables the ADC module
 *
 * Parameters: (none)
 *
 * Description:
 * Disables the entire ADC module, which will also affect the port registers. Fault states 
 * at certain pins will be lost as every pin will be re-configured as GPIO.
 * ***********************************************************************************************/

inline volatile uint16_t hsadc_module_disable(void)
{

	ADCON1Lbits.ADON = ADC_OFF;			// Disable ADC module 
	return(1 - ADCON1Lbits.ADON);

}

/*!hsadc_reset()
 * ************************************************************************************************
 * Summary:
 * Resets ADC configuration
 *
 * Parameters:	(none)
 *
 * Description:
 * Resets the entire ADC configuration including the port control registers. All ANx-inputs will
 * become GPIOs.
 * ***********************************************************************************************/

inline volatile uint16_t hsadc_reset(void) {
    
    /* ToDo: Add register contents check after WRITE */
    
	// Reset all ADC configuration registers to defaults

	ADCON1Lbits.ADON = ADC_OFF;				// Disable ADC
  
	ADCON1L	   = REG_ADCON1L_RESET;			// Disable and reset ADC configuration register 1 low
	ADCON1H	   = REG_ADCON1H_RESET;			// Disable and reset ADC configuration register 1 high
	ADCON2L	   = REG_ADCON2L_RESET;			// Disable and reset ADC configuration register 2 low
	ADCON2H	   = REG_ADCON2H_RESET;			// Disable and reset ADC configuration register 2 high
    ADCON3L    = REG_ADCON3L_RESET;			// Disable and reset ADC configuration register 3 low
    ADCON3H    = REG_ADCON3H_RESET;			// Disable and reset ADC configuration register 3 high
    #if defined (ADCON4L)
    ADCON4L    = REG_ADCON4L_RESET;			// Disable and reset ADC configuration register 4 low
    #endif
    #if defined (ADCON4H)
    ADCON4H    = REG_ADCON4H_RESET;			// Disable and reset ADC configuration register 4 high
    #endif
    ADCON5L    = REG_ADCON5L_RESET;			// Disable and reset ADC configuration register 5 low
    ADCON5H    = REG_ADCON5H_RESET;			// Disable and reset ADC configuration register 5 high

    /* ToDo: Rework RESET routine to filter on available registers
    ADMOD0L    = REG_ADMOD0L_RESET;
    ADMOD0H    = REG_ADMOD0H_RESET;
    ADMOD1L    = REG_ADMOD1L_RESET;   
    ADMOD1H    = REG_ADMOD1H_RESET;     
    ADIEL      = REG_ADIEL_RESET;
    ADIEH      = REG_ADIEH_RESET;
    ADSTATL    = REG_ADSTATL_RESET;      
    ADSTATH    = REG_ADSTATH_RESET;  
    ADCMP0ENL  = REG_ADCMPxENL_RESET;
    ADCMP0ENH  = REG_ADCMPxENH_RESET; 
    ADCMP0LO   = REG_ADCMPxLO_RESET;
    ADCMP0HI   = REG_ADCMPxHI_RESET;
    ADCMP1ENL  = REG_ADCMPxENL_RESET;
    ADCMP1ENH  = REG_ADCMPxENH_RESET;
    ADCMP1HI   = REG_ADCMPxHI_RESET;
    ADCMP2ENL  = REG_ADCMPxENL_RESET;
    ADCMP2ENH  = REG_ADCMPxENH_RESET;
    ADCMP2LO   = REG_ADCMPxLO_RESET;
    ADCMP2HI   = REG_ADCMPxHI_RESET;
    ADCMP3ENL  = REG_ADCMPxENL_RESET;
    ADCMP3ENH  = REG_ADCMPxENH_RESET;
    ADCMP3LO   = REG_ADCMPxLO_RESET;
    ADCMP3HI   = REG_ADCMPxHI_RESET;
    ADFL0DAT   = REG_ADFLxDAT_RESET;
    ADFL0CON   = REG_ADFLxCON_RESET;
    ADFL1DAT   = REG_ADFLxDAT_RESET;
    ADFL1CON   = REG_ADFLxCON_RESET;
    ADFL2DAT   = REG_ADFLxDAT_RESET;
    ADFL2CON   = REG_ADFLxCON_RESET;
    ADFL3DAT   = REG_ADFLxDAT_RESET;
    ADFL3CON   = REG_ADFLxCON_RESET;
    ADTRIG0L   = REG_ADTRIGxL_TRGSRC_NONE;
    ADTRIG0H   = REG_ADTRIGxH_TRGSRC_NONE;
    ADTRIG1L   = REG_ADTRIGxL_TRGSRC_NONE;
    ADTRIG1H   = REG_ADTRIGxH_TRGSRC_NONE;
    ADTRIG2L   = REG_ADTRIGxL_TRGSRC_NONE;
    ADTRIG2H   = REG_ADTRIGxL_TRGSRC_NONE;
    ADTRIG3L   = REG_ADTRIGxL_TRGSRC_NONE;
    ADTRIG3H   = REG_ADTRIGxH_TRGSRC_NONE;
    ADTRIG4L   = REG_ADTRIGxL_TRGSRC_NONE;
    ADTRIG4H   = REG_ADTRIGxH_TRGSRC_NONE;
    ADTRIG5L   = REG_ADTRIGxL_TRGSRC_NONE;
    ADTRIG5H   = REG_ADTRIGxH_TRGSRC_NONE;
    ADTRIG6L   = REG_ADTRIGxL_TRGSRC_NONE;
    ADCMP0CON  = REG_ADCMPxCON_RESET;
    ADCMP1CON  = REG_ADCMPxCON_RESET;
    ADCMP2CON  = REG_ADCMPxCON_RESET;
    ADCMP3CON  = REG_ADCMPxCON_RESET;
    ADLVLTRGL  = REG_ADLVLTRGL_RESET;
    ADLVLTRGH  = REG_ADLVLTRGH_RESET;
    ADCORE0L   = REG_ADCORExL_RESET;
    ADCORE0H   = REG_ADCORExH_RESET;
    ADCORE1L   = REG_ADCORExL_RESET;
    ADCORE1H   = REG_ADCORExH_RESET;
    ADEIEL     = REG_ADEIEL_RESET;
    ADEIEH     = REG_ADEIEH_RESET;
    ADEISTATL  = REG_ADEISTATL_RESET;
    ADEISTATH  = REG_ADEISTATH_RESET;
    */
    
	return(1);
}

/*!hsadc_power_on_adc_core()
 * ************************************************************************************************
 * Summary:
 * Turns on a single ADC core considering warm-up time
 *
 * Parameters:	(none)
 *
 * Description:
 * The individual ADC cores of the ADC peripheral require a self calibration procedure 
 * to meet the values given in the data sheet. The following function performs the self
 * calibration of the given ADC core.
 * ***********************************************************************************************/

inline volatile uint16_t hsadc_check_adc_cores_ready(void)
{
    volatile uint16_t timeout = 0, rdy_compare = 0, reg_buf = 0;

