areiter128/SMPS-MCAL-PLIB/p33SMPS_mcal.X/plibs/dsPIC33C/p33SMPS_hsadc.c
    /* ToDo: Add register contents check after WRITE */
    
    reg_buf = (ADCON5L & 0x00FF);
    rdy_compare = (reg_buf << 8);

    while( (((ADCON5L << 8) & 0xFF00) != rdy_compare) && (timeout++ < 0xFFFE) );
    if(timeout == 0xFFFF) return(0);
    else return(1);

}

/*!hsadc_calibrate_adc_core()
 * ************************************************************************************************
 * Summary:
 * Calls the ADC calibration of a single ADC core
 *
 * Parameters:	(none)
 *
 * Description:
 * The individual ADC cores of the ADC peripheral require a self calibration procedure 
 * to meet the values given in the data sheet. The following function performs the self
 * calibration of the given ADC core.
 * ***********************************************************************************************/
#if defined (__P33SMPS_EP__)
inline volatile uint16_t hsadc_calibrate_adc_core(uint16_t index, uint16_t calib_mode)
{
	volatile uint16_t timeout=0;
    volatile uint16_t *regptr;
    volatile uint16_t reg_offset=0;
    
    if (index >= ADC_CORE_COUNT) return(0);
    
    // Determine register set offset
    reg_offset = (index) * ((volatile uint16_t)&ADCAL1L - (volatile uint16_t)&ADCAL0L);
    regptr = (volatile uint16_t *)&ADCAL0L + reg_offset;
    
    // differentiate between odd and even indices due to shared registers
    if (index == ADC_SHARED_CORE_INDEX) {

        regptr = (volatile uint16_t *)&ADCAL1H;

        if ((*regptr & REG_ADCALx_HB_CALxRDY_SET_MSK) == 0)
        {
            *regptr |= REG_ADCALx_HB_CALxEN_SET_MSK;  // Enable calibration
            *regptr &= REG_ADCALx_HB_CALxSKIP_CLR_MSK;  // Initiate calibration
            *regptr &= ((calib_mode << 8) | REG_ADCALx_HB_CALxDIFF_CLR_MSK);  // Set calibration mode (differential or single ended))
            *regptr |= REG_ADCALx_HB_CALxRUN_SET_MSK;  // Initiate calibration

            // Wait until ADC core calibration has completed
            while( ((*regptr & REG_ADCALx_HB_CALxRDY_SET_MSK) == 0) && (timeout++<5000));
            if((*regptr & REG_ADCALx_HB_CALxRDY_SET_MSK) == 0) return(0);  // If core doesn't enter READY state, return failure

            *regptr &= REG_ADCALx_HB_CALxEN_CLR_MSK;  // Disable calibration
        }
        
    }
    else if(index & 0x0001) {
        // Odd index (1, 3, 5, ...) and shared ADC bits are located in the high-byte of the register word
        
        if ((*regptr & REG_ADCALx_HB_CALxRDY_SET_MSK) == 0)
        {
            *regptr |= REG_ADCALx_HB_CALxEN_SET_MSK;  // Enable calibration
            *regptr &= REG_ADCALx_HB_CALxSKIP_CLR_MSK;  // Initiate calibration
            *regptr &= ((calib_mode << 8) | REG_ADCALx_HB_CALxDIFF_CLR_MSK);  // Set calibration mode (differential or single ended))
            *regptr |= REG_ADCALx_HB_CALxRUN_SET_MSK;  // Initiate calibration

            // Wait until ADC core calibration has completed
            while( ((*regptr & REG_ADCALx_HB_CALxRDY_SET_MSK) == 0) && (timeout++<5000));
            if((*regptr & REG_ADCALx_HB_CALxRDY_SET_MSK) == 0) return(0);  // If core doesn't enter READY state, return failure

            *regptr &= REG_ADCALx_HB_CALxEN_CLR_MSK;  // Disable calibration
        }
    }
    else{
        // Even index (0, 2, 4, ...) bits are located in the low-byte of the register word
        
        if ((*regptr & REG_ADCALx_LB_CALxRDY_SET_MSK) == 0)
        {
            *regptr |= REG_ADCALx_LB_CALxEN_SET_MSK;  // Enable calibration
            *regptr &= REG_ADCALx_LB_CALxSKIP_CLR_MSK;  // Initiate calibration
            *regptr &= (calib_mode | REG_ADCALx_LB_CALxDIFF_CLR_MSK);  // Set calibration mode (differential or single ended))
            *regptr |= REG_ADCALx_LB_CALxRUN_SET_MSK;  // Initiate calibration

            // Wait until ADC core calibration has completed
            while( ((*regptr & REG_ADCALx_LB_CALxRDY_SET_MSK) == 0) && (timeout++<5000));
            if((*regptr & REG_ADCALx_LB_CALxRDY_SET_MSK) == 0) return(0);  // If core doesn't enter READY state, return failure

            *regptr &= REG_ADCALx_LB_CALxEN_CLR_MSK;  // Disable calibration
        }
    }
	
	return(1);
	
}
#endif
/*!hsadc_power_on_adc_core()
 * ************************************************************************************************
 * Summary:
 * Turns on a single ADC core considering warm-up time
 *
 * Parameters:	(none)
 *
 * Description:
 * The individual ADC cores of the ADC peripheral require a self calibration procedure 
 * to meet the values given in the data sheet. The following function performs the self
 * calibration of the given ADC core.
 * ***********************************************************************************************/

inline volatile uint16_t hsadc_power_on_adc_core(uint16_t index)
{
    volatile uint16_t *regptr;
    volatile uint16_t reg_buf=0;
    volatile uint16_t timeout=0;

    /* ToDo: Add register contents check after WRITE */
    
    if (index >= ADC_CORE_COUNT) return(0);
    
    regptr = (volatile uint16_t *)&ADCON5L;
    
    // Power on ADC core x 
    if(index == ADC_SHARED_CORE_INDEX) { 
      // Shared Core Power Setting is located in Bit #7, while all others are 
      // enumerated on Bits #0 = dedicated core #0, #1 = dedicated core #1, etc
        reg_buf  = (REG_ADCON5L_SHRPWR_ON & REG_ADCON5L_VALID_DATA_WRITE_MSK);
        
    }
    else {
      // Dedicated core power on enable bits are set based on the index/bit position 
        reg_buf  = ((0x0001 << index) & REG_ADCON5L_VALID_DATA_WRITE_MSK);
    }

    if(!(*regptr & reg_buf))   // if bit hasn't been set yet...
    { *regptr |= reg_buf; } // write to register


    // Check READY status of powered-up ADC core
    reg_buf <<= 8;   // Shift selected bit up into the high-word of ADCON5L for the status check
    while(!(ADCON5L & reg_buf) && (timeout++ < 0xFFFE) );
    if(timeout == 0xFFFF) return(0);
    
    // Set pointer onto ADC core enable register ADCON3H
    regptr = (volatile uint16_t *)&ADCON3H;
    
    // Power on ADC core x 
    if(index == ADC_SHARED_CORE_INDEX) { 
      // Shared Core Power Setting is located in Bit #7, while all others are 
      // enumerated on Bits #0 = dedicated core #0, #1 = dedicated core #1, etc
        reg_buf  = (REG_ADCON3H_SHREN_ENABLED & REG_ADCON3H_VALID_DATA_WRITE_MSK);
        
