areiter128/SMPS-MCAL-PLIB/p33SMPS_mcal.X/plibs/dsPIC33C/p33SMPS_hsadc.c
    }
    else {
      // Dedicated core power on enable bits are set based on the index/bit position 
        reg_buf  = ((0x0001 << index) & REG_ADCON3H_VALID_DATA_WRITE_MSK);
    }

    if(!(*regptr & reg_buf)) // if bit hasn't been set yet...
    { *regptr |= reg_buf; } // write to register
    
	return(1);
	
}

/*!hsadc_set_adc_core_trigger()
 * ************************************************************************************************
 * Summary:
 * Configures interrupt trigger setting of an individual Analog Input
 *
 * Parameters:
 * Returns: 	1: success, 0: failure
 *
 * Description:
 * 
 * ***********************************************************************************************/

inline volatile uint16_t hsadc_set_adc_input_trigger_source(uint16_t index, ADTRIG_TRGSRC_e trigger_source)
{

    volatile uint16_t *regptr;
    volatile uint16_t reg_offset;
    volatile uint16_t reg_buf=0;

    /* ToDo: Add register contents check after WRITE */
    
    if (index >= ADC_ANINPUT_COUNT) return(0);

    // Determine register set offset
    reg_offset = (index) * ((volatile uint16_t)&ADTRIG1L - (volatile uint16_t)&ADTRIG0L);
    regptr = (volatile uint16_t *)&ADTRIG0L + reg_offset;

    if (index & 0x0001) {
    // Odd analog input numbers are located in the high-byte of the register word
        reg_buf = ((trigger_source << 8) & REG_ADTRIGx_VALID_DATA_MSK);
        *regptr |= reg_buf;
    }
    else{
    // Even analog input numbers are located in the low-byte of the register word
        reg_buf = (trigger_source & REG_ADTRIGx_VALID_DATA_MSK);
        *regptr |= reg_buf;

    }

    return(1);
}

/*!hsadc_set_adc_input_interrupt()
 * ************************************************************************************************
 * Summary:
 * configures the interrupt generation of a single ADC core
 *
 * Parameters:	
 *     - index: 
 *         index of the ADC input (e.g. 0 for AN, 1 for AN1, etc)
 *     - interrupt_enable: 
 *         0 = no interrupt will be generated
 *         1 = interrupt will be generated
 *     - early_interrupt_enable: 
 *         0 = interrupt will be triggered after conversion is complete
 *         1 = interrupt will be triggered n TADs before conversion is complete
 * 
 * Returns:
 *     0: failure
 *     1: success
 * 
 * Description:
 * The individual ADC cores of the ADC peripheral support the generation of interrupts. Further
 * Those interrupts can be "pulled-in" to compensate the interrupt latency of the controller
 * ***********************************************************************************************/

inline volatile uint16_t hsadc_set_adc_input_interrupt(uint16_t index, uint16_t interrupt_enable, uint16_t early_interrupt_enable)
{
    volatile uint16_t *regptr;

    /* ToDo: Add register contents check after WRITE */
    
    if (index >= ADC_ANINPUT_COUNT) return(0);
    
    if (index<16) {   

        // Setting the Early Interrupt Enable Bit
        regptr = (volatile uint16_t *)&ADEIEL;
        *regptr |= (early_interrupt_enable << index);

        // Setting the Interrupt Enable Bit
        regptr = (volatile uint16_t *)&ADIEL;
        *regptr |= (interrupt_enable << index);
    }
    else {

        index -= 16;

        #ifdef ADEIEH
        // Setting the Early Interrupt Enable Bit
        regptr = (volatile uint16_t *)&ADEIEH;
        *regptr |= (early_interrupt_enable << index);

        // Setting the Interrupt Enable Bit
        regptr = (volatile uint16_t *)&ADIEH;
        *regptr |= (interrupt_enable << index);
        #else
        return(0);
        #endif
    }
    
	return(1);
	
}

/*!hsadc_set_adc_input_trigger_mode()
 * ************************************************************************************************
 * Summary:
 * Configures the trigger mode of an individual analog input
 *
 * Parameters:	
 *     - uint16_t index: 
 *         index of the ADC input (e.g. 0 for AN, 1 for AN1, etc)
 *     - ADLVLTRG_e trigger_mode: 
 *         0 = Edge trigger mode
 *         1 = level trigger mode
 * 
 * Returns:
 *     0: failure
 *     1: success
 * 
 * Description:
 * The individual analog inputs of the dsPIC can be triggered by many different sources
 * specified by the trigger source (see function hsadc_set_adc_input_trigger_source()).
 * This function is used to enable the desired trigger mode by setting the related 
 * register bits.
 * ***********************************************************************************************/

inline volatile uint16_t hsadc_set_adc_input_trigger_mode(uint16_t index, ADLVLTRG_e trigger_mode)
{
    volatile uint16_t fres = 1;
    volatile uint16_t *regptr;
    volatile uint16_t regval = 0;
    
    // Check if channel number exists
    if (index >= ADC_ANINPUT_COUNT) return(0);

    // Map bit on right register (HIGH or LOW)
    if (index<16) {   
        // Setting the Trigger Mode Bit
        regptr = (volatile uint16_t *)&ADLVLTRGL;
        regval = (((volatile uint16_t)trigger_mode << index) & REG_ADSTATL_VALID_DATA_MSK);
    }
    else {

        #ifdef ADLVLTRGH
        index -= 16;    // Scale ANx-number down into single register field
        regptr = (volatile uint16_t *)&ADLVLTRGH; // Set the Trigger Mode Bit
        regval = (((volatile uint16_t)trigger_mode << index) & REG_ADSTATH_VALID_DATA_MSK);
        #else
        return(0);  // Return ERROR if register does not exists
        #endif
    }

    // write value to register
    *regptr |= regval;
    
    // Check if bit has been set
    fres &= (volatile bool)((*regptr & regval) == regval);

    // Return Success/Error bit
	return(fres);
	
}

/*!hsadc_set_adc_input_mode()
 * ************************************************************************************************
 * Summary:
 * Configures the analog input mode of an individual analog input
 *
 * Parameters:	
 *     - index: 
 *         index of the ADC input (e.g. 0 for AN, 1 for AN1, etc)
 *     - ADMOD_INPUT_MODE_e input_mode: 
 *         0 = Single-Ended
 *         1 = Differential
 *     - ADMOD_OUTPUT_DATA_MODE_e data_mode:
 *         0 = unsigned number
 *         1 = signed number
 * 
 * Returns:
 *     0: failure
 *     1: success
 * 
 * Description:
 * The individual analog inputs of the dsPIC can be configured in single-ended or differential mode.
 * Each configuration has to be considered during the hardware design to make sure the signals
 * are captured correctly.
 * This function is used to enable the desired mode by setting the related register bits.
 * ***********************************************************************************************/

inline volatile uint16_t hsadc_set_adc_input_mode(uint16_t index, ADMOD_INPUT_MODE_e input_mode, ADMOD_OUTPUT_DATA_MODE_e data_mode) 
{
    volatile uint16_t fres = 1;
    volatile uint16_t *regptr;
    volatile uint16_t regval = 0;
    
    // Check if channel number exists
    if (index >= ADC_ANINPUT_COUNT) return(0);

    // Build dual-bit value of settings
    regval = ((uint16_t)input_mode << 1) | ((uint16_t)data_mode);
    
