areiter128/SMPS-MCAL-PLIB/p33SMPS_mcal.X/plibs/dsPIC33C/p33SMPS_hsadc.c
    // Map bit on right register (HIGH or LOW)
    if (index<8) {   
        // Setting the analog input mode of channel 0 to 7
        regptr = (volatile uint16_t *)&ADMOD0L;
        index <<= 1;    // Multiply index by 2
        regval = (((volatile uint16_t)input_mode << index) & REG_ADMOD0L_VALID_DATA_MSK);
    }
    else if (index<16) {   
        // Setting the analog input mode of channel 8 to 15
        index -= 8;     // Scale ANx-number down into single register field
        regptr = (volatile uint16_t *)&ADMOD0H;
        index <<= 1;    // Multiply index by 2
        regval = (((volatile uint16_t)input_mode << index) & REG_ADMOD0H_VALID_DATA_MSK);
    }
    else if (index<24) {   
        // Setting the analog input mode of channel 16 to 23
        index -= 16;     // Scale ANx-number down into single register field
        regptr = (volatile uint16_t *)&ADMOD1L;
        index <<= 1;    // Multiply index by 2
        regval = (((volatile uint16_t)input_mode << index) & REG_ADMOD1L_VALID_DATA_MSK);
    }
    else {

        #ifdef ADLVLTRGH
        // Setting the analog input mode of channel 24 to 31
        index -= 24;     // Scale ANx-number down into single register field
        regptr = (volatile uint16_t *)&ADMOD1H; // Set the Trigger Mode Bit
        index <<= 1;    // Multiply index by 2
        regval = (((volatile uint16_t)input_mode << index) & REG_ADMOD1H_VALID_DATA_MSK);
        #else
        return(0);  // Return ERROR if register does not exists
        #endif
    }

    // write value to register
    *regptr |= regval;
    
    // Check if bit has been set
    fres &= (volatile bool)((*regptr & regval) == regval);

    // Return Success/Error bit
	return(fres);
	
}



/*!hsadc_init_adc_comp
 * ************************************************************************************************
 * Summary:
 * Initializes an individual ADC digital Comparator configuration
 *
 * Parameters:
 *	HSADC_ADCMP_CONFIG_t adcmp_cfg = holds the ADC digital comparator configuration and values
 *                                   of upper and lower comparison thresholds
 * 
 * Description:
 * The ADC peripheral features a digital comparator, which compares the latest sample of a dedicated
 * ANx input with given upper and lower threshold values. If the values is outside the given range,
 * an interrupt will be triggered (if enabled).
 * This routine allows configuration of the comparator, the input source and its thresholds.
 * ***********************************************************************************************/

inline volatile uint16_t hsadc_init_adc_comp(uint16_t index, HSADC_ADCMP_CONFIG_t adcmp_cfg) {

    volatile uint16_t fres = 1;
    volatile uint16_t *regptr16;
    volatile uint16_t reg_offset = 0;
    volatile uint16_t reg_value = 0;


	if (index >= (ADC_ADCMP_COUNT-1)) return(0);    // Check if analog input number is valid
    
    // ADC Comparator Configuration
    reg_offset = (index) * ((volatile uint16_t)&ADCMP1CON - (volatile uint16_t)&ADCMP0CON); // Get register offset
    regptr16 = (volatile uint16_t *)&ADCMP0CON + reg_offset;      // Set digital comparator configuration value
    *regptr16 = (adcmp_cfg.ADCMPxCON.value & REG_ADCMPxCON_VALID_DATA_WR_MSK); // Write digital comparator value
    fres &= ((*regptr16 & REG_ADCMPxCON_VALID_DATA_RD_MSK) == (adcmp_cfg.ADCMPxCON.value & REG_ADCMPxCON_VALID_DATA_WR_MSK)); // Test if written value matches parameter
    
    // Lower Threshold Compare Value
    reg_offset = (index) * ((volatile uint16_t)&ADCMP1LO - (volatile uint16_t)&ADCMP0LO); // Get register offset
    regptr16 = (volatile uint16_t *)&ADCMP0LO + reg_offset;       // Get lower threshold value
    *regptr16 = (adcmp_cfg.ADCMPxLO & REG_ADCMPxLO_VALID_DATA_MSK);     // Write lower threshold value
    fres &= ((*regptr16 & REG_ADCMPxLO_VALID_DATA_MSK) == (adcmp_cfg.ADCMPxLO & REG_ADCMPxLO_VALID_DATA_MSK)); // Test if written value matches parameter

    // Upper Threshold Compare Value
    reg_offset = (index) * ((volatile uint16_t)&ADCMP1HI - (volatile uint16_t)&ADCMP0HI); // Get register offset
    regptr16 = (volatile uint16_t *)&ADCMP0HI + reg_offset;       // Get upper threshold value
    *regptr16 = (adcmp_cfg.ADCMPxHI & REG_ADCMPxHI_VALID_DATA_MSK);     // Write upper threshold value
    fres &= ((*regptr16 & REG_ADCMPxHI_VALID_DATA_MSK) == (adcmp_cfg.ADCMPxHI & REG_ADCMPxHI_VALID_DATA_MSK)); // Test if written value matches parameter
    
    
    // Capture ANx input number as source for comparison (this bit is automatically set and doesn't require to be set by the user)
    reg_value = adcmp_cfg.ADCMPxCON.bits.CHNL;  // Read ANx input number as comparison source
    
    if (reg_value < 16) {   

        // Enabling the corresponding analog input comparator input
        reg_offset = (index) * ((volatile uint16_t)&ADCMP1ENL - (volatile uint16_t)&ADCMP0ENL); // Get register offset
        regptr16 = (volatile uint16_t *)&ADCMP0ENL + reg_offset;    // Get upper threshold value
        *regptr16 = ((1 << reg_value) & REG_ADCMPxENH_VALID_DATA_MSK); // Write input channel enable bit

    }
    else if (reg_value < 32) {

        #ifdef ADCMP0ENH
        reg_value -= 16; // "Scale" analog input number 16-31 into register 

        // Enabling the corresponding analog input comparator input
        reg_offset = (index) * ((volatile uint16_t)&ADCMP1ENH - (volatile uint16_t)&ADCMP0ENH); // Get register offset
        regptr16 = (volatile uint16_t *)&ADCMP0ENH + reg_offset;    // Get upper threshold value
        *regptr16 = ((1 << reg_value) & REG_ADCMPxENH_VALID_DATA_MSK); // Write input channel enable bit
        #else
        return(0);
        #endif
    }
    else { return(0); }

    // Check if Analog Input Comparator Enable has been set correctly
    fres &= (volatile bool)(*regptr16 & (1 << reg_value)); // Test if written value matches parameter

    return(fres);
    
}


/*!hsadc_init_adc_filter
 * ************************************************************************************************
 * Summary:
 * Initializes an individual ADC digital Filter configuration
 *
 * Parameters:
 *	HSADC_ADFLT_CONFIG_t adflt_cfg = holds the ADC digital filter configuration and values
 *                                   of upper and lower comparison thresholds
 * 
 * Description:
 * The ADC peripheral features a digital filter, which offers averaging and oversampling 
 * filter capabilities. Depending on the setting, this filter will be averaging the most recent 
 * samples of the assigned analog input ANx until the averaging setting is matched and the data
 * is provided in an independent register FLTxDAT. In oversampling mode, the assigned analog 
 * input ANx is continuously oversampled until the oversampling setting is matched. 
 * 
 * This routine allows configuration of the comparator, the input source and its thresholds.
 * The filter result register FLTxDAT will be reset or pre-charged, but not updated automatically.
 * ***********************************************************************************************/

inline volatile uint16_t hsadc_init_adc_filter(uint16_t index, HSADC_ADFLT_CONFIG_t adflt_cfg) {

    volatile uint16_t fres = 1;
    volatile uint16_t *regptr16;
    volatile uint16_t reg_offset = 0;


	if (index >= (ADC_ADFL_COUNT-1)) return(0);    // Check if analog input number is valid

    
    // ADC Comparator Configuration
    reg_offset = (index) * ((volatile uint16_t)&ADFL1CON - (volatile uint16_t)&ADFL0CON); // Get register offset
    regptr16 = (volatile uint16_t *)&ADFL0CON + reg_offset;      // Set digital comparator configuration value
    *regptr16 = (adflt_cfg.ADFLxCON.value & REG_ADFLxCON_VALID_DATA_WR_MSK); // Write digital comparator value
    fres &= ((*regptr16 & REG_ADFLxCON_VALID_DATA_RD_MSK) == (adflt_cfg.ADFLxCON.value & REG_ADFLxCON_VALID_DATA_WR_MSK)); // Test if written value matches parameter
    
    // Lower Threshold Compare Value
    reg_offset = (index) * ((volatile uint16_t)&ADFL1DAT - (volatile uint16_t)&ADFL0DAT); // Get register offset
    regptr16 = (volatile uint16_t *)&ADFL0DAT + reg_offset;       // Get lower threshold value
    *regptr16 = (adflt_cfg.ADFLxDAT & REG_ADFLxDAT_VALID_DATA_MSK);     // Write lower threshold value
    fres &= ((*regptr16 & REG_ADFLxDAT_VALID_DATA_MSK) == (adflt_cfg.ADFLxDAT & REG_ADFLxDAT_VALID_DATA_MSK)); // Test if written value matches parameter

    
    return(fres);
    
}



// EOF
